{"title":"Remnants of a Lost Nation: The Ruin Machines","description":"Ruin Machines, ancient mechanical war devices, are among the most formidable remnants of the lost civilization of Khaenri'ah. These machines, found across the ruins of Teyvat, showcase the advanced technology and military prowess of a nation long since fallen into obscurity.\n\nThese Ruin Machines come in various forms, including humanoid Ruin Guards, Ruin Hunters, and Ruin Graders, as well as animal-like Ruin Sentinels and even dragon-like Ruin Drakes capable of elemental absorption. Each machine has a distinct letter-number serial code, with prefixes such as \"Hu-\" for Guards, \"Fo-\" for Hunters, \"Ra-\" for Graders, \"Ald-\" for Sentinels, and \"Faf-\" for Drakes.\n\n The origins of these machines trace back to Khaenri'ah, where they were known as \"Field Tillers,\" reflecting the saying, \"The land is not to be tilled with farming tools, but rather to be fought for with steel and blood.\" After the fall of Khaenri'ah, these machines roamed Teyvat for centuries, often ending up in ancient ruins. The people of the present era mistook them as guardians of these ruins, hence the name \"Ruin Machines.\"\n\nOne notable group associated with these Ruin Machines is the Schwanenritter, an order of knights from Khaenri'ah led by Knight Marshal Anfortas. During the cataclysm that befell Khaenri'ah, the Schwanenritter fought valiantly against Abyssal monsters and used Mechanical Wardens, the three Ruin Golems found throughout Sumeru, to resist these beasts. The Schwanenritter evacuated able-bodied survivors to Sumeru, using the golems to protect and fight alongside them.\n\nIn Sumeru, the Schwanenritter and Khaenri'ahn survivors moved eastwards to Dharma Forest, losing one Ruin Golem at the Desert of Hadramaveth and another at the Valley of Dahri due to mechanical failures and lack of parts. The final Ruin Golem made it to Devantaka Mountain, where the sage Nagarjuna of the Sumeru Akademiya acknowledged the Schwanenritter as \"heroes of Dahri.\"\n\n Art Credits: 吃咖喱的poi","color":41832,"timestamp":"2024-07-07T00:40:12.658Z","footer":{"text":"Article Credits: Mystichunterz"},"image":{"url":"https://cdn.discordapp.com/attachments/818031871215796245/1259307775289458710/xzzh8c4y9cr51.webp?ex=668b3542&is=6689e3c2&hm=278adbda2bb4d4732f19c80c1201598db2561f8cdb41fadf878bc092fe989ffe&"}}